app/controllers/authentication_controller.rb

  def login
    @user = User.find_by_email(params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'email@email.com' LIMIT 1