app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
  def index
    @categories = Category.all

INSERT INTO `categories` (`label`, `active`, `description`, `created_at`, `updated_at`) VALUES ('Beleza', TRUE, 'Todas as categorias de beleza', '2020-09-01 13:35:19.611669', '2020-09-01 13:35:19.611669')
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
    def set_category
      @category = Category.find(params[:id])