app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT `cities`.* FROM `cities`

  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save
---
INSERT INTO `cities` (`label`, `created_at`, `updated_at`) VALUES ('Presidente Prudente', '2020-09-01 13:56:29.038782', '2020-09-01 13:56:29.038782')

    def set_city
      @city = City.find(params[:id])
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1