app/controllers/faqs_controller.rb

  def index
    @faqs = Faq.all
---
SELECT `faqs`.* FROM `faqs`

  def create
    @faq = Faq.new(faq_params)

    respond_to do |format|
      if @faq.save
---
INSERT INTO `faqs` (`question`, `response`, `isActive`, `order`, `created_at`, `updated_at`) VALUES ('Pergunta 01', 'Resposta 01', TRUE, 1, '2020-09-01 13:33:14.296058', '2020-09-01 13:33:14.296058')

    def set_faq
      @faq = Faq.find(params[:id])
---
SELECT `faqs`.* FROM `faqs` WHERE `faqs`.`id` = 1 LIMIT 1