app/controllers/neighborhoods_controller.rb

SELECT `neighborhoods`.* FROM `neighborhoods`
---
  def index
    @neighborhoods = Neighborhood.all

INSERT INTO `neighborhoods` (`label`, `isActive`, `isDelivery`, `City_id`, `created_at`, `updated_at`) VALUES ('Sto Expedito 1', TRUE, TRUE, 1, '2020-09-01 13:57:01.817390', '2020-09-01 13:57:01.817390')
---
  def create
    @neighborhood = Neighborhood.new(neighborhood_params)

    respond_to do |format|
      if @neighborhood.save

SELECT `neighborhoods`.* FROM `neighborhoods` WHERE `neighborhoods`.`id` = 1 LIMIT 1
---
    def set_neighborhood
      @neighborhood = Neighborhood.find(params[:id])