app/controllers/order_shippings_controller.rb

SELECT `order_shippings`.* FROM `order_shippings`
---
  def index
    @order_shippings = OrderShipping.all