app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT `products`.* FROM `products`

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`title`, `sub_title`, `price_before`, `price`, `sub_category_id`, `description`, `created_at`, `updated_at`) VALUES ('a', 'b', 0.0, 15.5, 1, 'TESTE', '2020-09-08 13:30:44.047993', '2020-09-08 13:30:44.047993')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `products`.`updated_at` = '2020-09-01 14:11:04.625348' WHERE `products`.`id` = 2

    def set_product
      @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1