app/controllers/sub_category_neighborhoods_controller.rb

  def index
    @sub_category_neighborhoods = SubCategoryNeighborhood.all
---
SELECT `sub_category_neighborhoods`.* FROM `sub_category_neighborhoods`

    def set_sub_category_neighborhood
      @sub_category_neighborhood = SubCategoryNeighborhood.find(params[:id])
---
SELECT `neighborhoods`.* FROM `neighborhoods` WHERE `neighborhoods`.`id` = 1 LIMIT 1
SELECT `sub_category_neighborhoods`.* FROM `sub_category_neighborhoods` WHERE `sub_category_neighborhoods`.`id` = 1 LIMIT 1