app/controllers/sub_categories_controller.rb

  def index
    @sub_categories = SubCategory.all
---
SELECT `sub_categories`.* FROM `sub_categories`

    def set_sub_category
      @sub_category = SubCategory.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1