app/controllers/subcategories_controller.rb

SELECT `sub_categories`.* FROM `sub_categories`
SELECT `subcategories`.* FROM `subcategories`
---
  def index
    @subcategories = Subcategory.all

INSERT INTO `subcategories` (`category_id`, `label`, `active`, `description`, `created_at`, `updated_at`) VALUES (1, 'Unha', TRUE, '1', '2020-09-01 13:44:37.686319', '2020-09-01 13:44:37.686319')
---
  def create
    @subcategory = Subcategory.new(subcategory_params)

    respond_to do |format|
      if @subcategory.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`id` = 1 LIMIT 1
---
    def set_subcategory
      @subcategory = Subcategory.find(params[:id])