app/controllers/user_infos_controller.rb

SELECT `user_infos`.* FROM `user_infos`
---
  def index
    @user_infos = UserInfo.all

INSERT INTO `user_infos` (`user_id`, `name`, `indentifyId`, `birthday`, `isActive`, `created_at`, `updated_at`) VALUES (1, '', '', '2020-09-08', FALSE, '2020-09-08 13:05:54.690392', '2020-09-08 13:05:54.690392')
---
  def create
    @user_info = UserInfo.new(user_info_params)

    respond_to do |format|
      if @user_info.save

UPDATE `user_infos` SET `user_infos`.`indentifyId` = '36631490804', `user_infos`.`updated_at` = '2020-09-08 13:10:00.172426' WHERE `user_infos`.`id` = 1
---
  def update
    respond_to do |format|
      if @user_info.update(user_info_params)

DELETE FROM `user_infos` WHERE `user_infos`.`id` = 2
---
  def destroy
    @user_info.destroy

SELECT `user_infos`.* FROM `user_infos` WHERE `user_infos`.`id` = 1 LIMIT 1
---
    def set_user_info
      @user_info = UserInfo.find(params[:id])