app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('name', 'username', 'email@email.com', '$2a$12$8nqOYT09gVKe3LopWR9T4eRCfKdQ8I9WzpFXGynTGLbtHXRTmKy/y', '2020-02-11 19:23:12.040406', '2020-02-11 19:23:12.040406')
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE `users` SET `users`.`updated_at` = '2020-02-11 19:00:40.653070' WHERE `users`.`id` = 1
---
  def update
    unless @user.update(user_params)